var i=0;
 while(true){
        var Name = prompt("Введіть будь ласка прізвище та ім'я студента " + (i + 1));
        // Перевірка на наявність одного пробілу у змінній Name
        var spaceCount = (Name.match(/ /g) || []).length;
        if (spaceCount !== 1) {
            alert("Прізвище та ім'я повинні містити рівно один пробіл.");
            continue;
        }
        // Перевірка на наявність цифр або інших спеціальних символів у імені
        if (!/^[А-Яа-яA-Za-zіІїЇЄєь`\s-']+$/.test(Name.split(" ")[1])) {
            alert("Ім'я студента повинно містити тільки букви і не містити цифр або спеціальних символів.");
            continue;
        }
        i++;
        document.write((i) + ". " + Name + "<br>");
 }